{
  "CATEGORY": {
    "ADD": {
      "FAILED": "Hey! You need to wait for options to show before hitting enter. You entered \"{{categoryId}}\" which isn't a category here.",
      "INVALID": "I failed to find that category! Try again.",
      "CATEGORY": {
        "FIND_FAILED": "Failed to find the category!",
        "ROLES_EMPTY": "Hey! For some reason I don't see any react roles in that category. If this issues persist please report it to the support server.",
        "ROLES_MAX": "Hey! Category {{categoryName}}` already has the max of 20 react roles. This is due to Discords reaction limitation. Make another category!"
      },
      "REACT_ROLE": {
        "FIND_FAILED": "Failed to find the react role!",
        "EXISTING": "Hey! This role is already in the category `{{categoryName}}`.",
        "ADD_MORE": "I've added `{{reactRoleName}}` to `{{categoryName}}`, you can add more roles if you wish.",
        "NO_MORE": "I've added `{{reactRoleName}}` to `{{categoryName}}`. If you want to add more you need to create more react roles first.",
        "UPDATE_FAILED": "Hey! I had an issue adding `{{reactRoleName}}` to the category `{{categoryName}}`. Please wait a second and try again.",
        "EMPTY": "You should create a few react roles first! Check out `/react-role`!"
      },
      "BUTTON": {
        "ADD": "Below are reaction roles and their respective emojis. Click the buttons you want to add to the category `{{categoryName}}`.",
        "FAIL": "Hey! I had an issue making some buttons for you. Sometimes emojis aren't supported, like iPhone emojis, please make sure to use Discords emoji picker.\nIf the problem persist please visit the support server found in the `/info` command so we can figure out the issue!"
      }
    },
    "CREATE": {
      "SUCCESS": "Hey! I successfully created the category `{{name}}` for you!",
      "FAILED": "Hey! I had some trouble creating that category for you. Please wait a minute and try again.",
      "CATEGORY": {
        "INVALID_NAME": "Hey! It says you submitted no category name! You need to submit that. Please try again.",
        "MAX_NAME_LENGTH": "Hey! Discord only allows 100 characters max for their embed titles. Try making the category name simple and make the rest the category description!",
        "EXIST": "Hey! It turns out you already have a category with that name made. Try checking it out."
      }
    },
    "EDIT": {
      "SUCCESS": "Hey! I successfully updated the category `{{name}}` for you.",
      "FAILED": "Hey! I couldn't update the category `{{name}}` for you.",
      "INVALID": "Hey! You need to pass at _least_ one updated field about the category.",
      "CATEGORY": {
        "INVALID_ID": "I couldn't find the category from the command. Please try again.",
        "INVALID": "Hey! I couldn't find the category. Please wait a second and try again."
      }
    }
  },
  "": ""
}